In [2]:
import pandas as pd
import numpy as np

In [3]:
data = pd.read_csv("reviews.csv")
data

   ReviewID  ProductID  CustomerID  Rating
0       301      201.0           1     5.0
1       302      202.0           3     4.0
2       303      203.0           2     3.0
3       304      204.0           5     NaN
4       305        NaN           4     5.0

In [4]:
data.shape

(5, 4)

In [5]:
data.head()

   ReviewID  ProductID  CustomerID  Rating
0       301      201.0           1     5.0
1       302      202.0           3     4.0
2       303      203.0           2     3.0
3       304      204.0           5     NaN
4       305        NaN           4     5.0

In [6]:
data.tail()

   ReviewID  ProductID  CustomerID  Rating
0       301      201.0           1     5.0
1       302      202.0           3     4.0
2       303      203.0           2     3.0
3       304      204.0           5     NaN
4       305        NaN           4     5.0

In [7]:
data.head(2)

   ReviewID  ProductID  CustomerID  Rating
0       301      201.0           1     5.0
1       302      202.0           3     4.0

In [8]:
data.tail(3)

   ReviewID  ProductID  CustomerID  Rating
2       303      203.0           2     3.0
3       304      204.0           5     NaN
4       305        NaN           4     5.0

In [9]:
data.describe()

         ReviewID   ProductID  CustomerID    Rating
count    5.000000    4.000000    5.000000  4.000000
mean   303.000000  202.500000    3.000000  4.250000
std      1.581139    1.290994    1.581139  0.957427
min    301.000000  201.000000    1.000000  3.000000
25%    302.000000  201.750000    2.000000  3.750000
50%    303.000000  202.500000    3.000000  4.500000
75%    304.000000  203.250000    4.000000  5.000000
max    305.000000  204.000000    5.000000  5.000000

In [10]:
data.columns

Index(['ReviewID', 'ProductID', 'CustomerID', 'Rating'], dtype='object')

In [11]:
data['Rating']

0    5.0
1    4.0
2    3.0
3    NaN
4    5.0
Name: Rating, dtype: float64

In [12]:
data[['ReviewID', 'CustomerID', 'Rating']]

   ReviewID  CustomerID  Rating
0       301           1     5.0
1       302           3     4.0
2       303           2     3.0
3       304           5     NaN
4       305           4     5.0

In [13]:
data.isnull()

   ReviewID  ProductID  CustomerID  Rating
0     False      False       False   False
1     False      False       False   False
2     False      False       False   False
3     False      False       False    True
4     False       True       False   False

In [14]:
new_data = data.dropna(axis = 0)
new_data

   ReviewID  ProductID  CustomerID  Rating
0       301      201.0           1     5.0
1       302      202.0           3     4.0
2       303      203.0           2     3.0

In [15]:
new_data = data.dropna(axis = 1)
new_data

   ReviewID  CustomerID
0       301           1
1       302           3
2       303           2
3       304           5
4       305           4

In [16]:
new_data = data.interpolate
new_data

<bound method NDFrame.interpolate of    ReviewID  ProductID  CustomerID  Rating
0       301      201.0           1     5.0
1       302      202.0           3     4.0
2       303      203.0           2     3.0
3       304      204.0           5     NaN
4       305        NaN           4     5.0>

In [17]:
new_data = data.fillna(data['Rating'].mean())
new_data

   ReviewID  ProductID  CustomerID  Rating
0       301     201.00           1    5.00
1       302     202.00           3    4.00
2       303     203.00           2    3.00
3       304     204.00           5    4.25
4       305       4.25           4    5.00

In [18]:
new_data=data.fillna(method='ffill')
new_data

C:\Users\K Sai Prasanna\AppData\Local\Temp\ipykernel_378736\126269373.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  new_data=data.fillna(method='ffill')

   ReviewID  ProductID  CustomerID  Rating
0       301      201.0           1     5.0
1       302      202.0           3     4.0
2       303      203.0           2     3.0
3       304      204.0           5     3.0
4       305      204.0           4     5.0

In [19]:
new_data=data.fillna(method='bfill')
new_data

C:\Users\K Sai Prasanna\AppData\Local\Temp\ipykernel_378736\1407429032.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  new_data=data.fillna(method='bfill')

   ReviewID  ProductID  CustomerID  Rating
0       301      201.0           1     5.0
1       302      202.0           3     4.0
2       303      203.0           2     3.0
3       304      204.0           5     5.0
4       305        NaN           4     5.0

In [23]:
data.fillna(0, inplace = True)
data

   ReviewID  ProductID  CustomerID  Rating
0       301      201.0           1     5.0
1       302      202.0           3     4.0
2       303      203.0           2     3.0
3       304      204.0           5     0.0
4       305        0.0           4     5.0

In [24]:
data['new_col'] = data['CustomerID'] + data['ProductID']
data

   ReviewID  ProductID  CustomerID  Rating  new_col
0       301      201.0           1     5.0    202.0
1       302      202.0           3     4.0    205.0
2       303      203.0           2     3.0    205.0
3       304      204.0           5     0.0    209.0
4       305        0.0           4     5.0      4.0

In [25]:
pd.get_dummies(data['Rating'])

     0.0    3.0    4.0    5.0
0  False  False  False   True
1  False  False   True  False
2  False   True  False  False
3   True  False  False  False
4  False  False  False   True

In [26]:
data.groupby('Rating')['new_col'].sum()

Rating
0.0    209.0
3.0    205.0
4.0    205.0
5.0    206.0
Name: new_col, dtype: float64

In [27]:
data.agg({'Rating' : 'mean', 'CustomerID' : 'sum'})

Rating         3.4
CustomerID    15.0
dtype: float64

In [28]:
data.pivot_table(values='Rating', index='CustomerID', aggfunc='sum')

            Rating
CustomerID
1              5.0
2              3.0
3              4.0
4              5.0
5              0.0

In [29]:
data.replace({0.0, 1.0})

C:\Users\K Sai Prasanna\AppData\Local\Temp\ipykernel_378736\3647353491.py:1: FutureWarning: DataFrame.replace without 'value' and with non-dict-like 'to_replace' is deprecated and will raise in a future version. Explicitly specify the new values instead.
  data.replace({0.0, 1.0})

   ReviewID  ProductID  CustomerID  Rating  new_col
0       301      201.0           1     5.0    202.0
1       302      202.0           3     4.0    205.0
2       303      203.0           2     3.0    205.0
3       304      204.0           5     0.0    209.0
4       305        0.0           4     5.0      4.0

In [30]:
data.drop_duplicates()

   ReviewID  ProductID  CustomerID  Rating  new_col
0       301      201.0           1     5.0    202.0
1       302      202.0           3     4.0    205.0
2       303      203.0           2     3.0    205.0
3       304      204.0           5     0.0    209.0
4       305        0.0           4     5.0      4.0

In [31]:
data['ProductID'].value_counts()

ProductID
201.0    1
202.0    1
203.0    1
204.0    1
0.0      1
Name: count, dtype: int64

In [32]:
new_data = (data['CustomerID'] - data['CustomerID'].mean()) / data['CustomerID'].std()
new_data

0   -1.264911
1    0.000000
2   -0.632456
3    1.264911
4    0.632456
Name: CustomerID, dtype: float64

In [33]:
new_data = data['Rating'].apply(np.log1p)
new_data

0    1.791759
1    1.609438
2    1.386294
3    0.000000
4    1.791759
Name: Rating, dtype: float64

In [34]:
data.to_csv('modified_reviews.csv')